Revit 2027 API
ParameterTypeId.ForegroundDraftPatternIdParam Property
 "Foreground Fill Pattern"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ForegroundDraftPatternIdParam { get; }
Public Shared ReadOnly Property ForegroundDraftPatternIdParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ForegroundDraftPatternIdParam {
	ForgeTypeId^ get ();
}
static member ForegroundDraftPatternIdParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace